src/cf/InformationRegisters/СостоянияCDNПлощадокМДЛП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СостоянияCDNПлощадокМДЛП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СреднееВремяПроверкиКМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СреднееВремяОтвета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНедоступнаДоУниверсальная</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОбновленияУниверсальная</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Сервер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗащищенноеСоединение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>АдресПлощадки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/СостоянияCDNПлощадокМДЛП/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает разделение адреса площадки на сервер, порт и защищенное соединение.
//
// Параметры:
//  АдресПлощадки - Строка - полный адрес площадки, http://....ru
//
// Возвращаемое значение:
//  Структура - структура адреса:
// * Сервер - Строка - сервер, данные без http:// и порта
// * Порт - Число - порт
// * ЗащищенноеСоединение - Булево - Истина, если https://
//
Функция РазобратьАдресПлощадкиНаСерверИПорт(Знач АдресПлощадки) Экспорт
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Сервер",         "");
	СтруктураВозврата.Вставить("Порт",                 0);
	СтруктураВозврата.Вставить("ЗащищенноеСоединение", Ложь);
	
	УдалитьНачалоСтрокиПодключения = Ложь;
	
	Если СтрНачинаетсяС(ВРег(АдресПлощадки), "HTTPS://") Тогда
		
		СтруктураВозврата.ЗащищенноеСоединение = Истина;
		УдалитьНачалоСтрокиПодключения         = Истина;
		
	ИначеЕсли СтрНачинаетсяС(ВРег(АдресПлощадки), "HTTP://") Тогда
		
		СтруктураВозврата.ЗащищенноеСоединение = Ложь;
		УдалитьНачалоСтрокиПодключения         = Истина;
		
	КонецЕсли;
	
	Если УдалитьНачалоСтрокиПодключения Тогда
		
		Если СтруктураВозврата.ЗащищенноеСоединение Тогда
			АдресПлощадки = Прав(АдресПлощадки, СтрДлина(АдресПлощадки) - 8);
		Иначе
			АдресПлощадки = Прав(АдресПлощадки, СтрДлина(АдресПлощадки) - 7);
		КонецЕсли;
		
	КонецЕсли;
	
	МассивСлов = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов(АдресПлощадки, ":");
	
	Если МассивСлов.Количество() > 1 Тогда
		
		ОписаниеТипаЧисло = ОбщегоНазначения.ОписаниеТипаЧисло(0);
		СтруктураВозврата.Порт = ОписаниеТипаЧисло.ПривестиЗначение(МассивСлов[МассивСлов.Количество() - 1]);
		
		МассивСлов.Удалить(МассивСлов.Количество() - 1);
		
		СтруктураВозврата.Сервер = СтрСоединить(МассивСлов, ":");
	
	ИначеЕсли МассивСлов.Количество() = 1 Тогда
		
		СтруктураВозврата.Сервер = АдресПлощадки;
		СтруктураВозврата.Порт   = 443;
		
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

// Запись данных площадок в регистр СостоянияCDNПлощадокМДЛП.
//
// Параметры:
//  СписокПлощадок - Соответствие Из КлючИЗначение - полученные CDN-площадки:
//   * Ключ - Строка - Адрес площадки.
//   * Значение - Структура - замеры скорости CDN-площадок.
// Возвращаемое значение:
//  Структура:
//     * Отказ - Булево.
//     * ТекстОшибки - Строка - заполнено, если Отказ = Истина.
//
Функция ЗаписатьДанныеСостоянияCDNПлощадок(СписокПлощадок) Экспорт
	
	РезультатВозврата = Новый Структура("Отказ, ТекстОшибки", Ложь, "");
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.СостоянияCDNПлощадокМДЛП");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		
		Блокировка.Заблокировать();
		
		НаборЗаписей = СоздатьНаборЗаписей();
		НаборЗаписей.Записать();
		
		Для Каждого КлючИЗначение Из СписокПлощадок Цикл
			
			ЗаписьРегистра = СоздатьМенеджерЗаписи();
			
			ЗаписьРегистра.АдресПлощадки          = КлючИЗначение.Ключ;
			ЗаписьРегистра.СреднееВремяОтвета     = КлючИЗначение.Значение.СреднееВремяОтвета;
			ЗаписьРегистра.СреднееВремяПроверкиКМ = КлючИЗначение.Значение.СреднееВремяПроверкиКМ;
			
			Если ЗаписьРегистра.СреднееВремяОтвета < 0 Тогда
				// Площадка временно заблокирована.
				ЗаписьРегистра.ДатаНедоступнаДоУниверсальная = ДатаНедоступностиCDNПлощадкиПриБлокировке();
			КонецЕсли;
			
			ЗаписьРегистра.Записать();
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		РезультатВозврата.Отказ       = Истина;
		РезультатВозврата.ТекстОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	Возврат РезультатВозврата;
	
КонецФункции

// Блокирует список CDN-площадок на время, указанное пользователем,
//  или стандартный срок из настроек.
//
// Параметры:
//  МассивПлощадок - Массив из Строка - Массив площадок к блокировке.
//  ВремяБлокировки - Число - Время блокировки, если 0, то берется стандартное время блокировки.
//
Процедура ЗаблокироватьСписокПлощадок(МассивПлощадок, ВремяБлокировки = 0) Экспорт
	
	Если МассивПлощадок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого АдресПлощадки Из МассивПлощадок Цикл
		
		МенеджерЗаписи = СоздатьМенеджерЗаписи();
		МенеджерЗаписи.АдресПлощадки = АдресПлощадки;
		МенеджерЗаписи.Прочитать();
		
		Если Не МенеджерЗаписи.Выбран() Тогда
			Продолжить;
		КонецЕсли;
		
		МенеджерЗаписи.ДатаНедоступнаДоУниверсальная = ДатаНедоступностиCDNПлощадкиПриБлокировке(ВремяБлокировки);
		МенеджерЗаписи.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

// Получение даты недоступности площадки при блокировке на определенный период времени.
// 
// Параметры:
//  ВремяБлокировки - Число - Время блокировки, если 0, то берется стандартное время блокировки
//
// Возвращаемое значение:
//  Дата - дата недоступности
//
Функция ДатаНедоступностиCDNПлощадкиПриБлокировке(ВремяБлокировки = 0) Экспорт
	
	Если ВремяБлокировки = 0 Тогда
		ВремяБлокировки = РазрешительныйРежимМДЛПКлиентСервер.ВремяБлокировкиCDNПлощадки();
	КонецЕсли;
	
	Возврат ТекущаяУниверсальнаяДата() + ВремяБлокировки * 60;
	
КонецФункции

// Возвращает признак необходимости обновления площадок и их ранжированный список
//  от наиболее приоритетной по скорости отклика до наименее приоритетной.
//
// Возвращаемое значение:
//  Структура - структура данных CDN-площадок:
// * ТребуетсяОбновлениеПлощадок - Булево - признак, что все площадки либо заблокированы, либо не загружены,
//    либо срок их актуальности подошел к концу.
// * ТаблицаПлощадок - ТаблицаЗначений - сортированный список CDN-площадок:
//  ** АдресПлощадки        - Строка - адрес площадки.
//  ** Сервер               - Строка - адрес сервера.
//  ** Порт                 - Число - порт.
//  ** ЗащищенноеСоединение - Булево - защищенное соединение.
//  ** СкоростьОтклика      - Число - общая скорость отклика, сумма среднего времени обработки КМ на площадке и времени обращения к ней.
//  ** ПлощадкаДоступна     - Булево - признак доступности площадки.
//
Функция СортированнаяТаблицаCDNПлощадок() Экспорт
	
	ТаблицаПлощадок = Новый ТаблицаЗначений();
	ТаблицаПлощадок.Колонки.Добавить("АдресПлощадки",        ОбщегоНазначения.ОписаниеТипаСтрока(200));
	ТаблицаПлощадок.Колонки.Добавить("Сервер",               ОбщегоНазначения.ОписаниеТипаСтрока(200));
	ТаблицаПлощадок.Колонки.Добавить("Порт",                 ОбщегоНазначения.ОписаниеТипаЧисло(6));
	ТаблицаПлощадок.Колонки.Добавить("ЗащищенноеСоединение", Новый ОписаниеТипов("Булево"));
	ТаблицаПлощадок.Колонки.Добавить("СкоростьОтклика",      ОбщегоНазначения.ОписаниеТипаЧисло(10));
	ТаблицаПлощадок.Колонки.Добавить("ПлощадкаДоступна",     Новый ОписаниеТипов("Булево"));
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	CDNПлощадки.АдресПлощадки                                               КАК АдресПлощадки,
	|	CDNПлощадки.Сервер                                                      КАК Сервер,
	|	CDNПлощадки.Порт                                                        КАК Порт,
	|	CDNПлощадки.ЗащищенноеСоединение                                        КАК ЗащищенноеСоединение,
	|	CDNПлощадки.СреднееВремяОтвета + CDNПлощадки.СреднееВремяПроверкиКМ КАК СкоростьОтклика,
	|	CDNПлощадки.ДатаНедоступнаДоУниверсальная < &ТекущаяУниверсальнаяДата   КАК ПлощадкаДоступна,
	|	ДОБАВИТЬКДАТЕ(CDNПлощадки.ДатаОбновленияУниверсальная, ЧАС,
	|		&ВремяОбновленияПлощадок) >= &ТекущаяУниверсальнаяДата                  КАК ПлощадкаАктуальна,
	|	CDNПлощадки.СреднееВремяПроверкиКМ > 0
	|		И CDNПлощадки.СреднееВремяОтвета > 0                                КАК БылПолученОтветПлощадки
	|ИЗ
	|	РегистрСведений.СостоянияCDNПлощадокМДЛП КАК CDNПлощадки
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПлощадкаДоступна УБЫВ,
	|	БылПолученОтветПлощадки УБЫВ,
	|	СкоростьОтклика
	|");
	
	Запрос.УстановитьПараметр("ВремяОбновленияПлощадок",  РазрешительныйРежимМДЛПКлиентСервер.ЧастотаОбновленияCDNПлощадок());
	Запрос.УстановитьПараметр("ТекущаяУниверсальнаяДата", ТекущаяУниверсальнаяДата());
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ЕстьХотяБыОднаАктивнаяПлощадка = Ложь;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НоваяСтрока = ТаблицаПлощадок.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		
		Если Не ЕстьХотяБыОднаАктивнаяПлощадка
			И ВыборкаДетальныеЗаписи.ПлощадкаАктуальна Тогда
			ЕстьХотяБыОднаАктивнаяПлощадка = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	СтруктураВозврата = Новый Структура();
	СтруктураВозврата.Вставить("ТребуетсяОбновлениеПлощадок", Не ЕстьХотяБыОднаАктивнаяПлощадка);
	СтруктураВозврата.Вставить("ТаблицаПлощадок",             ТаблицаПлощадок);
	
	Возврат СтруктураВозврата;
	
КонецФункции

// Возвращает признак необходимости запуска процедуры обновления списка CDN-площадок.
//
// Возвращаемое значение:
//  Булево - Истина, если список площадок пуст (при первом запуске) или все площадки обновлены ранее срока их актуальности.
//
Функция ТребуетсяОбновлениеСпискаCDNПлощадок() Экспорт
	
	Если Не РазрешительныйРежимМДЛПКлиентСервер.ПродукцияПодлежитОбязательнойОнлайнПроверкеПередРозничнойПродажей() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	ИСТИНА КАК ЕстьАктивныеПлощадки
	|ИЗ
	|	РегистрСведений.СостоянияCDNПлощадокМДЛП КАК CDNПлощадки
	|ГДЕ
	|	ДОБАВИТЬКДАТЕ(CDNПлощадки.ДатаОбновленияУниверсальная, СЕКУНДА, &ВремяОбновленияПлощадок) >= &ТекущаяУниверсальнаяДата
	|");
	
	Запрос.УстановитьПараметр("ВремяОбновленияПлощадок",  РазрешительныйРежимМДЛПКлиентСервер.ЧастотаОбновленияCDNПлощадок() * 3600);
	Запрос.УстановитьПараметр("ТекущаяУниверсальнаяДата", ТекущаяУниверсальнаяДата());
	
	РезультатЗапроса = Запрос.Выполнить();
	ТребуетсяОбновление = РезультатЗапроса.Пустой();
	
	Возврат ТребуетсяОбновление;
	
КонецФункции

#КонецОбласти // СлужебныйПрограммныйИнтерфейс

#КонецЕсли
